[
  {
    "level": "0",
    "spells": [
      {
        "name": "acid_splash",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60ft",
        "components": "V,S",
        "duration": "Instantaneous",
        "effect": "You create an acidic bubble at a point within range, where it explodes in a 5-foot-radius Sphere. Each creature in that Sphere must succeed on a Dexterity saving throw or take 1d6 Acid damage.",
        "upgrade": "The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
      },
      {
        "name": "blade_ward",
        "school": "Abjuration ",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "Whenever a creature makes an attack roll against you before the spell ends, the attacker subtracts 1d4 from the attack roll.",
        "upgrade": ""
      },
      {
        "name": "chill_touch",
        "school": "Necromancy ",
        "class": ["sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "Channeling the chill of the grave, make a melee spell attack against a target within reach. On a hit, the target takes 1d10 Necrotic damage, and it can’t regain Hit Points until the end of your next turn.",
        "upgrade": "The damage increases by 1d10 when you reach levels 5 (2d10), 11 (3d10), and 17 (4d10)."
      },
      {
        "name": "cancing_lights",
        "school": "Illusion",
        "class": ["bard", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S, M (a bit of phosphorus)",
        "duration": "Concentration, up to 1 minute",
        "effect": "ou create up to four torch-size lights within range, making them appear as torches, lanterns, or glowing orbs that hover for the duration. Alternatively, you combine the four lights into one glowing Medium form that is vaguely humanlike. Whichever form you choose, each light sheds Dim Light in a 10-foot radius.\n\nAs a Bonus Action, you can move the lights up to 60 feet to a space within range. A light must be within 20 feet of another light created by this spell, and a light vanishes if it exceeds the spell’s range.",
        "upgrade": ""
      },
      {
        "name": "druidcraft",
        "school": "Transmutation",
        "class": ["druid"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "Weather Sensor. You create a Tiny, harmless sensory effect that predicts what the weather will be at your location for the next 24 hours. The effect might manifest as a golden orb for clear skies, a cloud for rain, falling snowflakes for snow, and so on. This effect persists for 1 round.\n\nBloom. You instantly make a flower blossom, a seed pod open, or a leaf bud bloom.\n\nSensory Effect. You create a harmless sensory effect, such as falling leaves, spectral dancing fairies, a gentle breeze, the sound of an animal, or the faint odor of skunk. The effect must fit in a 5-foot Cube.\n\nFire Play. You light or snuff out a candle, a torch, or a campfire.",
        "upgrade": ""
      },
      {
        "name": "eldritch_blast",
        "school": "Evocation",
        "class": ["warlock"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You hurl a beam of crackling energy. Make a ranged spell attack against one creature or object in range. On a hit, the target takes 1d10 Force damage.",
        "upgrade": "The spell creates two beams at level 5, three beams at level 11, and four beams at level 17. You can direct the beams at the same target or at different ones. Make a separate attack roll for each beam."
      },
      {
        "name": "elementalism",
        "school": "Transmutation",
        "class": ["druid", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You exert control over the elements, creating one of the following effects within range.\n\nBeckon Air. You create a breeze strong enough to ripple cloth, stir dust, rustle leaves, and close open doors and shutters, all in a 5-foot Cube. Doors and shutters being held open by someone or something aren’t affected.\n\nBeckon Earth. You create a thin shroud of dust or sand that covers surfaces in a 5-foot-square area, or you cause a single word to appear in your handwriting in a patch of dirt or sand.\n\nBeckon Fire. You create a thin cloud of harmless embers and colored, scented smoke in a 5-foot Cube. You choose the color and scent, and the embers can light candles, torches, or lamps in that area. The smoke’s scent lingers for 1 minute.\n\nBeckon Water. You create a spray of cool mist that lightly dampens creatures and objects in a 5-foot Cube. Alternatively, you create 1 cup of clean water either in an open container or on a surface, and the water evaporates in 1 minute.\n\nSculpt Element. You cause dirt, sand, fire, smoke, mist, or water that can fit in a 1-foot Cube to assume a crude shape (such as that of a creature) for 1 hour.",
        "upgrade": ""
      },
      {
        "name": "fire_bolt",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You hurl a mote of fire at a creature or an object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 Fire damage. A flammable object hit by this spell starts burning if it isn’t being worn or carried.",
        "upgrade": "The damage increases by 1d10 when you reach levels 5 (2d10), 11 (3d10), and 17 (4d10)."
      },
      {
        "name": "friends",
        "school": "Enchantment",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "10 feet",
        "components": "S, M (some makeup)",
        "duration": "Concentration, up to 1 minute",
        "effect": "You magically emanate a sense of friendship toward one creature you can see within range. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The target succeeds automatically if it isn’t a Humanoid, if you’re fighting it, or if you have cast this spell on it within the past 24 hours.\n\nThe spell ends early if the target takes damage or if you make an attack roll, deal damage, or force anyone to make a saving throw. When the spell ends, the target knows it was Charmed by you.",
        "upgrade": ""
      },
      {
        "name": "guidance",
        "school": "Divination",
        "class": ["cleric", "druid"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "You touch a willing creature and choose a skill. Until the spell ends, the creature adds 1d4 to any ability check using the chosen skill.",
        "upgrade": ""
      },
      {
        "name": "light",
        "school": "Evocation",
        "class": ["bard", "cleric", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, M (a firefly or phosphorescent moss)",
        "duration": "1 hour",
        "effect": "You touch one Large or smaller object that isn’t being worn or carried by someone else. Until the spell ends, the object sheds Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. The light can be colored as you like.\n\nCovering the object with something opaque blocks the light. The spell ends if you cast it again.",
        "upgrade": ""
      },
      {
        "name": "mage_hand",
        "school": "Conjuration",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "1 minute",
        "effect": "A spectral, floating hand appears at a point you choose within range. The hand lasts for the duration. The hand vanishes if it is ever more than 30 feet away from you or if you cast this spell again.\n\nWhen you cast the spell, you can use the hand to manipulate an object, open an unlocked door or container, stow or retrieve an item from an open container, or pour the contents out of a vial.\n\nAs a Magic action on your later turns, you can control the hand thus again. As part of that action, you can move the hand up to 30 feet.\n\nThe hand can’t attack, activate magic items, or carry more than 10 pounds.",
        "upgrade": ""
      },
      {
        "name": "mending",
        "school": "Transmutation",
        "class": ["bard", "cleric", "druid", "sorcerer", "wizard"],
        "casting_time": "1 minute",
        "range": "Touch",
        "components": "V, S, M (two lodestones)",
        "duration": "Instantaneous",
        "effect": "This spell repairs a single break or tear in an object you touch, such as a broken chain link, two halves of a broken key, a torn cloak, or a leaking wineskin. As long as the break or tear is no larger than 1 foot in any dimension, you mend it, leaving no trace of the former damage.\n\nThis spell can physically repair a magic item, but it can’t restore magic to such an object.",
        "upgrade": ""
      },
      {
        "name": "message",
        "school": "Transmutation",
        "class": ["bard", "druid", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "S, M (a copper wire)",
        "duration": "1 round",
        "effect": "You point toward a creature within range and whisper a message. The target (and only the target) hears the message and can reply in a whisper that only you can hear.\n\nYou can cast this spell through solid objects if you are familiar with the target and know it is beyond the barrier. Magical silence; 1 foot of stone, metal, or wood; or a thin sheet of lead blocks the spell.",
        "upgrade": ""
      },
      {
        "name": "mind_sliver",
        "school": "Enchantment ",
        "class": ["sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V",
        "duration": "1 round",
        "effect": "You try to temporarily sliver the mind of one creature you can see within range. The target must succeed on an Intelligence saving throw or take 1d6 Psychic damage and subtract 1d4 from the next saving throw it makes before the end of your next turn.",
        "upgrade": "The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
      },
      {
        "name": "minor_illusion",
        "school": "Illusion",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "S, M (a bit of fleece)",
        "duration": "1 minute",
        "effect": "You create a sound or an image of an object within range that lasts for the duration. See the descriptions below for the effects of each. The illusion ends if you cast this spell again.\n\nIf a creature takes a Study action to examine the sound or image, the creature can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the illusion becomes faint to the creature.\n\nSound. If you create a sound, its volume can range from a whisper to a scream. It can be your voice, someone else’s voice, a lion’s roar, a beating of drums, or any other sound you choose. The sound continues unabated throughout the duration, or you can make discrete sounds at different times before the spell ends.\n\nImage. If you create an image of an object—such as a chair, muddy footprints, or a small chest—it must be no larger than a 5-foot Cube. The image can’t create sound, light, smell, or any other sensory effect. Physical interaction with the image reveals it to be an illusion, since things can pass through it.",
        "upgrade": ""
      },
      {
        "name": "poison_spray",
        "school": "Necromancy ",
        "class": ["druid", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You spray toxic mist at a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d12 Poison damage.",
        "upgrade": "The damage increases by 1d12 when you reach levels 5 (2d12), 11 (3d12), and 17 (4d12)."
      },
      {
        "name": "prestidigitation",
        "school": "Transmutation",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "10 feet",
        "components": "V, S",
        "duration": "Up to 1 hour",
        "effect": "You create a magical effect within range. Choose the effect from the options below. If you cast this spell multiple times, you can have up to three of its non-instantaneous effects active at a time.\n\nSensory Effect. You create an instantaneous, harmless sensory effect, such as a shower of sparks, a puff of wind, faint musical notes, or an odd odor.\n\nFire Play. You instantaneously light or snuff out a candle, a torch, or a small campfire.\n\nClean or Soil. You instantaneously clean or soil an object no larger than 1 cubic foot.\n\nMinor Sensation. You chill, warm, or flavor up to 1 cubic foot of nonliving material for 1 hour.\n\nMagic Mark. You make a color, a small mark, or a symbol appear on an object or a surface for 1 hour.\n\nMinor Creation. You create a nonmagical trinket or an illusory image that can fit in your hand. It lasts until the end of your next turn. A trinket can deal no damage and has no monetary worth.",
        "upgrade": ""
      },
      {
        "name": "produce_flame",
        "school": "Conjuration",
        "class": ["druid"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S",
        "duration": "10 minutes",
        "effect": "A flickering flame appears in your hand and remains there for the duration. While there, the flame emits no heat and ignites nothing, and it sheds Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. The spell ends if you cast it again.\n\nUntil the spell ends, you can take a Magic action to hurl fire at a creature or an object within 60 feet of you. Make a ranged spell attack. On a hit, the target takes 1d8 Fire damage.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "ray_of_frost",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "A frigid beam of blue-white light streaks toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 1d8 Cold damage, and its Speed is reduced by 10 feet until the start of your next turn.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "resistance",
        "school": "Abjuration",
        "class": ["cleric", "druid"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "You touch a willing creature and choose a damage type: Acid, Bludgeoning, Cold, Fire, Lightning, Necrotic, Piercing, Poison, Radiant, Slashing, or Thunder. When the creature takes damage of the chosen type before the spell ends, the creature reduces the total damage taken by 1d4. A creature can benefit from this spell only once per turn.",
        "upgrade": ""
      },
      {
        "name": "sacred_flame",
        "school": "Evocation",
        "class": ["cleric"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "Flame-like radiance descends on a creature that you can see within range. The target must succeed on a Dexterity saving throw or take 1d8 Radiant damage. The target gains no benefit from Half Cover or Three-Quarters Cover for this save.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "shillelagh",
        "school": "Transmutation",
        "class": ["druid"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S, M (mistletoe)",
        "duration": "1 minute",
        "effect": "A Club or Quarterstaff you are holding is imbued with nature’s power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon’s damage die becomes a d8. If the attack deals damage, it can be Force damage or the weapon’s normal damage type (your choice).\n\nThe spell ends early if you cast it again or if you let go of the weapon.",
        "upgrade": "The damage die changes when you reach levels 5 (d10), 11 (d12), and 17 (2d6)."
      },
      {
        "name": "shocking_grasp",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "Lightning springs from you to a creature that you try to touch. Make a melee spell attack against the target. On a hit, the target takes 1d8 Lightning damage, and it can’t make Opportunity Attacks until the start of its next turn.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "sorcerous_burst",
        "school": "Evocation",
        "class": ["sorcerer"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You cast sorcerous energy at one creature or object within range. Make a ranged attack roll against the target. On a hit, the target takes 1d8 damage of a type you choose: Acid, Cold, Fire, Lightning, Poison, Psychic, or Thunder.\n\nIf you roll an 8 on a d8 for this spell, you can roll another d8, and add it to the damage. When you cast this spell, the maximum number of these d8s you can add to the spell’s damage equals your spellcasting ability modifier.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "spare_the_dying",
        "school": "Necromancy ",
        "class": ["cleric", "druid"],
        "casting_time": "Action",
        "range": "15 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "Choose a creature within range that has 0 Hit Points and isn’t dead. The creature becomes Stable.",
        "upgrade": "The range doubles when you reach levels 5 (30 feet), 11 (60 feet), and 17 (120 feet)."
      },
      {
        "name": "starry_wisp",
        "school": "Evocation",
        "class": ["bard", "druid"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You launch a mote of light at one creature or object within range. Make a ranged spell attack against the target. On a hit, the target takes 1d8 Radiant damage, and until the end of your next turn, it emits Dim Light in a 10-foot radius and can’t benefit from the Invisible condition.",
        "upgrade": "The damage increases by 1d8 when you reach levels 5 (2d8), 11 (3d8), and 17 (4d8)."
      },
      {
        "name": "thaumaturgy",
        "school": "Transmutation",
        "class": ["cleric", ""],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V",
        "duration": "Up to 1 minute",
        "effect": "You manifest a minor wonder within range. You create one of the effects below within range. If you cast this spell multiple times, you can have up to three of its 1-minute effects active at a time.\n\nAltered Eyes. You alter the appearance of your eyes for 1 minute.\n\nBooming Voice. Your voice booms up to three times as loud as normal for 1 minute. For the duration, you have Advantage on Charisma (Intimidation) checks.\n\nFire Play. You cause flames to flicker, brighten, dim, or change color for 1 minute.\n\nInvisible Hand. You instantaneously cause an unlocked door or window to fly open or slam shut.\n\nPhantom Sound. You create an instantaneous sound that originates from a point of your choice within range, such as a rumble of thunder, the cry of a raven, or ominous whispers.\n\nTremors. You cause harmless tremors in the ground for 1 minute.",
        "upgrade": ""
      },
      {
        "name": "thorn_whip",
        "school": "Transmutation",
        "class": ["druid"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (the stem of a thorny plant)",
        "duration": "Instantaneous",
        "effect": "You create a vine-like whip covered in thorns that lashes out at your command toward a creature in range. Make a melee spell attack against the target. On a hit, the target takes 1d6 Piercing damage, and if it is Large or smaller, you can pull it up to 10 feet closer to you.",
        "upgrade": "The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
      },
      {
        "name": "thunderclap",
        "school": "Evocation",
        "class": ["bard", "druid", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "S",
        "duration": "Instantaneous",
        "effect": "Each creature in a 5-foot Emanation originating from you must succeed on a Constitution saving throw or take 1d6 Thunder damage. The spell’s thunderous sound can be heard up to 100 feet away.",
        "upgrade": "The damage increases by 1d6 when you reach levels 5 (2d6), 11 (3d6), and 17 (4d6)."
      },
      {
        "name": "toll_the_dead",
        "school": "Necromancy",
        "class": ["cleric", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You point at one creature you can see within range, and the single chime of a dolorous bell is audible within 10 feet of the target. The target must succeed on a Wisdom saving throw or take 1d8 Necrotic damage. If the target is missing any of its Hit Points, it instead takes 1d12 Necrotic damage.",
        "upgrade": "The damage increases by one die when you reach levels 5 (2d8 or 2d12), 11 (3d8 or 3d12), and 17 (4d8 or 4d12)."
      },
      {
        "name": "true_strike",
        "school": "Divination",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "S, M (a weapon with which you have proficiency and that is worth 1+ CP)",
        "duration": "Instantaneous",
        "effect": "Guided by a flash of magical insight, you make one attack with the weapon used in the spell’s casting. The attack uses your spellcasting ability for the attack and damage rolls instead of using Strength or Dexterity. If the attack deals damage, it can be Radiant damage or the weapon’s normal damage type (your choice).",
        "upgrade": " Whether you deal Radiant damage or the weapon’s normal damage type, the attack deals extra Radiant damage when you reach levels 5 (1d6), 11 (2d6), and 17 (3d6)."
      }
    ]
  },
  {
    "level": "1",
    "spell": [
      {
        "name": "alarm",
        "school": "Abjuration",
        "class": ["ranger", "wizard"],
        "casting_time": "1 minute or Ritual",
        "range": "30 feet",
        "components": "V, S, M (a bell and silver wire)",
        "duration": "8 hours",
        "effect": "You set an alarm against intrusion. Choose a door, a window, or an area within range that is no larger than a 20-foot Cube. Until the spell ends, an alarm alerts you whenever a creature touches or enters the warded area. When you cast the spell, you can designate creatures that won’t set off the alarm. You also choose whether the alarm is audible or mental:\n\nAudible Alarm. The alarm produces the sound of a handbell for 10 seconds within 60 feet of the warded area.\n\nMental Alarm. You are alerted by a mental ping if you are within 1 mile of the warded area. This ping awakens you if you’re asleep.",
        "upgrade": ""
      },
      {
        "name": "animal_friendship",
        "school": "Enchantment",
        "class": ["bard", "druid", "ranger"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (a morsel of food)",
        "duration": "24 hours",
        "effect": "Target a Beast that you can see within range. The target must succeed on a Wisdom saving throw or have the Charmed condition for the duration. If you or one of your allies deals damage to the target, the spells ends.",
        "upgrade": "You can target one additional Beast for each spell slot level above 1."
      },
      {
        "name": "armor_of_agathys",
        "school": "Abjuration ",
        "class": ["warlock"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S, M (a shard of blue glass)",
        "duration": "1 Hour",
        "effect": "Protective magical frost surrounds you. You gain 5 Temporary Hit Points. If a creature hits you with a melee attack roll before the spell ends, the creature takes 5 Cold damage. The spell ends early if you have no Temporary Hit Points",
        "upgrade": "The Temporary Hit Points and the Cold damage both increase by 5 for each spell slot level above 1."
      },
      {
        "name": "arms_of_hadar",
        "school": "Conjuration",
        "class": ["warlock"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "nvoking Hadar, you cause tendrils to erupt from yourself. Each creature in a 10-foot Emanation originating from you makes a Strength saving throw. On a failed save, a target takes 2d6 Necrotic damage and can’t take Reactions until the start of its next turn. On a successful save, a target takes half as much damage only.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "bane",
        "school": "Enchantment",
        "class": ["bard", "cleric", "warlock"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (a drop of blood)",
        "duration": "Concentration, up to 1 minute",
        "effect": "Up to three creatures of your choice that you can see within range must each make a Charisma saving throw. Whenever a target that fails this save makes an attack roll or a saving throw before the spell ends, the target must subtract 1d4 from the attack roll or save.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "bless",
        "school": "Enchantment",
        "class": ["cleric", "paladin"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (a Holy Symbol worth 5+ GP)",
        "duration": "Concentration, up to 1 minute",
        "effect": "You bless up to three creatures within range. Whenever a target makes an attack roll or a saving throw before the spell ends, the target adds 1d4 to the attack roll or save.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "burning_hands",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "A thin sheet of flames shoots forth from you. Each creature in a 15-foot Cone makes a Dexterity saving throw, taking 3d6 Fire damage on a failed save or half as much damage on a successful one\n\nFlammable objects in the Cone that aren’t being worn or carried start burning.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "charm_person",
        "school": "Enchantment",
        "class": ["bard", "druid", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "1 hour",
        "effect": "One Humanoid you can see within range makes a Wisdom saving throw. It does so with Advantage if you or your allies are fighting it. On a failed save, the target has the Charmed condition until the spell ends or until you or your allies damage it. The Charmed creature is Friendly to you. When the spell ends, the target knows it was Charmed by you.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "chromatic_orb",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "90 feet",
        "components": "V, S, M (a diamond worth 50+ GP)",
        "duration": "Instantaneous",
        "effect": "You hurl an orb of energy at a target within range. Choose Acid, Cold, Fire, Lightning, Poison, or Thunder for the type of orb you create, and then make a ranged spell attack against the target. On a hit, the target takes 3d8 damage of the chosen type.\n\nIf you roll the same number on two or more of the d8s, the orb leaps to a different target of your choice within 30 feet of the target. Make an attack roll against the new target, and make a new damage roll. The orb can’t leap again unless you cast the spell with a level 2+ spell slot.",
        "upgrade": "The damage increases by 1d8 for each spell slot level above 1. The orb can leap a maximum number of times equal to the level of the slot expended, and a creature can be targeted only once by each casting of this spell."
      },
      {
        "name": "color_spray",
        "school": "Illusion",
        "class": ["bard", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S, M (a pinch of colorful sand)",
        "duration": "Instantaneous",
        "effect": "You launch a dazzling array of flashing, colorful light. Each creature in a 15-foot Cone originating from you must succeed on a Constitution saving throw or have the Blinded condition until the end of your next turn.",
        "upgrade": ""
      },
      {
        "name": "command",
        "school": "Enchantment",
        "class": ["bard", "cleric", "paladin"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "You speak a one-word command to a creature you can see within range. The target must succeed on a Wisdom saving throw or follow the command on its next turn. Choose the command from these options:\n\nApproach. The target moves toward you by the shortest and most direct route, ending its turn if it moves within 5 feet of you.\n\nDrop. The target drops whatever it is holding and then ends its turn.\n\nFlee. The target spends its turn moving away from you by the fastest available means.\n\nGrovel. The target has the Prone condition and then ends its turn.\n\nHalt. On its turn, the target doesn’t move and takes no action or Bonus Action.",
        "upgrade": "You can affect one additional creature for each spell slot level above 1."
      },
      {
        "name": "compelled_duel",
        "school": "Enchantment",
        "class": ["paladin"],
        "casting_time": "Bonus Action",
        "range": "30 feet",
        "components": "V",
        "duration": "Concentration, up to 1 minute",
        "effect": "You try to compel a creature into a duel. One creature that you can see within range makes a Wisdom saving throw. On a failed save, the target has Disadvantage on attack rolls against creatures other than you, and it can't willingly move to a space that is more than 30 feet away from you.\n\nThe spell ends if you make an attack roll against a creature other than the target, if you cast a spell on an enemy other than the target, if an ally of yours damages the target, or if you end your turn more than 30 feet away from the target.",
        "upgrade": ""
      },
      {
        "name": "comprehend_languages",
        "school": "Divination",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action or Ritual",
        "range": "Self",
        "components": "V, S, M (a pinch of soot and salt)",
        "duration": "1 hour",
        "effect": "For the duration, you understand the literal meaning of any language that you hear or see signed. You also understand any written language that you see, but you must be touching the surface on which the words are written. It takes about 1 minute to read one page of text. This spell doesn't decode symbols or secret messages.",
        "upgrade": ""
      },
      {
        "name": "create_or_destroy-water",
        "school": "Transmutation",
        "class": ["cleric", "druid"],
        "casting_time": "Action or Ritual",
        "range": "30 feet",
        "components": "V, S, M (a mix of water and sand)",
        "duration": "Instantaneous",
        "effect": "You do one of the following:\n\nCreate Water. You create up to 10 gallons of clean water within range in an open container. Alternatively, the water falls as rain in a 30-foot Cube within range, extinguishing exposed flames there.\n\nDestroy Water. You destroy up to 10 gallons of water in an open container within range. Alternatively, you destroy fog in a 30-foot Cube within range.",
        "upgrade": "You create or destroy 10 additional gallons of water, or the size of the Cube increases by 5 feet, for each spell slot level above 1."
      },
      {
        "name": "cure_wounds",
        "school": "Abjuration",
        "class": ["bard", "cleric", "druid", "paladin", "ranger"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "A creature you touch regains a number of Hit Points equal to 2d8 plus your spellcasting ability modifier.",
        "upgrade": "The healing increases by 2d8 for each spell slot level above 1."
      },
      {
        "name": "detect_evil_and_good",
        "school": "Divination",
        "class": ["cleric", "paladin"],
        "casting_time": "Action or Ritual",
        "range": "Self",
        "components": "V, S",
        "duration": "Concentration, up to 10 minute",
        "effect": "For the duration, you sense the location of any Aberration, Celestial, Elemental, Fey, Fiend, or Undead within 30 feet of yourself. You also sense whether the Hallow spell is active there and, if so, where.\n\nThe spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead.",
        "upgrade": ""
      },
      {
        "name": "detect_magic",
        "school": "Divination",
        "class": [
          "bard",
          "cleric",
          "druid",
          "ranger",
          "sorcerer",
          "warlock",
          "wizard"
        ],
        "casting_time": "Action or Ritual",
        "range": "Self",
        "components": "V, S",
        "duration": "Concentration, up to 10 minute",
        "effect": "For the duration, you sense the presence of magical effects within 30 feet of yourself. If you sense such effects, you can take the Magic action to see a faint aura around any visible creature or object in the area that bears the magic, and if an effect was created by a spell, you learn the spell's school of magic.\n\nThe spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead.",
        "upgrade": ""
      },
      {
        "name": "detect_poison_and_disease",
        "school": "Divination",
        "class": ["cleric", "druid", "paladin", "ranger"],
        "casting_time": "Action or Ritual",
        "range": "Self",
        "components": "V, S, M (a yew leaf)",
        "duration": "Concentration, up to 10 minute",
        "effect": "For the duration, you sense the location of poisons, poisonous or venomous creatures, and magical contagions within 30 feet of yourself. You sense the kind of poison, creature, or contagion in each case.\n\nThe spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead.",
        "upgrade": ""
      },
      {
        "name": "disguise_self",
        "school": "Illusion",
        "class": ["bard", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "1 hour",
        "effect": "You make yourself - including your clothing, armor, weapons, and other belongings on your person - look different until the spell ends. You can seem 1 foot shorter or taller and can appear heavier or lighter. You must adopt a form that has the same basic arrangement of limbs as you have. Otherwise, the extent of the illusion is up to you.\n\nThe changes wrought by this spell fail to hold up to physical inspection. For example, if you use this spell to add a hat to your outfit, objects pass through the hat, and anyone who touches it would feel nothing.\n\nTo discern that you are disguised, a creature must take the Study action to inspect your appearance and succeed on an Intelligence (Investigation) check against your spell save DC.",
        "upgrade": ""
      },
      {
        "name": "dissonant_whispers",
        "school": "Enchantment",
        "class": ["bard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "One creature of your choice that you can see within range hears a discordant melody in its mind. The target makes a Wisdom saving throw. On a failed save, it takes 3d6 Psychic damage and must immediately use its Reaction, if available, to move as far away from you as it can, using the safest route. On a successful save, the target takes half as much damage only.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "divine_favor",
        "school": "Transmutation",
        "class": ["paladin"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S",
        "duration": "1 minute",
        "effect": "Until the spell ends, your attacks with weapons deal an extra 1d4 Radiant damage on a hit.",
        "upgrade": ""
      },
      {
        "name": "divine_smite",
        "school": "Evocation",
        "class": ["paladin"],
        "casting_time": "Bonus Action, which you take immediately after hitting a target with a Melee weapon or an Unarmed Strike",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "The target takes an extra 2d8 Radiant damage from the attack. The damage increases by 1d8 if the target is a Fiend or an Undead.",
        "upgrade": "The damage increases by 1d8 for each spell slot level above 1."
      },
      {
        "name": "ensnaring_strike",
        "school": "Conjuration",
        "class": ["ranger"],
        "casting_time": "Bonus Action, which you take immediately after hitting a creature with a weapon",
        "range": "Self",
        "components": "V",
        "duration": "Concentration, up to 1 minute",
        "effect": "As you hit the target, grasping vines appear on it, and it makes a Strength saving throw. A Large or larger creature has Advantage on this save. On a failed save, the target has the Restrained condition until the spell ends. On a successful save, the vines shrivel away, and the spell ends.\n\nWhile Restrained, the target takes 1d6 Piercing damage at the start of each of its turns. The target or a creature within reach of it can take an action to make a Strength (Athletics) check against your spell save DC. On a success, the spell ends.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "entangle",
        "school": "Conjuration",
        "class": ["druid", "ranger"],
        "casting_time": "Action",
        "range": "90 feet",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "Grasping plants sprout from the ground in a 20-foot square within range. For the duration, these plants turn the ground in the area into Difficult Terrain. They disappear when the spell ends.\n\nEach creature (other than you) in the area when you cast the spell must succeed on a Strength saving throw or have the Restrained condition until the spell ends. A Restrained creature can take an action to make a Strength (Athletics) check against your spell save DC. On a success, it frees itself from the grasping plants and is no longer Restrained by them.",
        "upgrade": ""
      },
      {
        "name": "expeditious_retreat",
        "school": "Transmutation",
        "class": ["sorcerer", "warlock", "wizard"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Concentration, up to 10 minute",
        "effect": "You take the Dash action, and until the spell ends, you can take that action again as a Bonus Action.",
        "upgrade": ""
      },
      {
        "name": "faerie_fire",
        "school": "Evocation",
        "class": ["bard", "druid"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V",
        "duration": "Concentration, up to 1 minute",
        "effect": "Objects in a 20-foot Cube within range are outlined in blue, green, or violet light (your choice). Each creature in the Cube is also outlined if it fails a Dexterity saving throw. For the duration, objects and affected creatures shed Dim Light in a 10-foot radius and can’t benefit from the Invisible condition.\n\nAttack rolls against an affected creature or object have Advantage if the attacker can see it.",
        "upgrade": ""
      },
      {
        "name": "false_life",
        "school": "Necromancy",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S, M (a drop of alcohol)",
        "duration": "Instantaneous",
        "effect": "You gain 2d4 + 4 Temporary Hit Points.",
        "upgrade": "You gain 5 additional Temporary Hit Points for each spell slot level above 1."
      },
      {
        "name": "feather_fall",
        "school": "Transmutation",
        "class": ["bard", "sorcerer", "wizard"],
        "casting_time": "Reaction, which you take when you or a creature you can see within 60 feet of you falls",
        "range": "60 feet",
        "components": "V, M (a small feather or piece of down)",
        "duration": "1 minute",
        "effect": "Choose up to five falling creatures within range. A falling creature’s rate of descent slows to 60 feet per round until the spell ends. If a creature lands before the spell ends, the creature takes no damage from the fall, and the spell ends for that creature.",
        "upgrade": ""
      },
      {
        "name": "find_familiar",
        "school": "Conjuration",
        "class": ["wizard"],
        "casting_time": "1 hour or Ritual",
        "range": "10 feet",
        "components": "V, S, M (burning incense worth 10+ GP, which the spell consumes)",
        "duration": "Instantaneous",
        "effect": "You gain the service of a familiar, a spirit that takes an animal form you choose: Bat, Cat, Frog, Hawk, Lizard, Octopus, Owl, Rat, Raven, Spider, Weasel, or another Beast that has a Challenge Rating of 0. Appearing in an unoccupied space within range, the familiar has the statistics of the chosen form (see appendix B), though it is a Celestial, Fey, or Fiend (your choice) instead of a Beast. Your familiar acts independently of you, but it obeys your commands.\n\nTelepathic Connection. While your familiar is within 100 feet of you, you can communicate with it telepathically. Additionally, as a Bonus Action, you can see through the familiar’s eyes and hear what it hears until the start of your next turn, gaining the benefits of any special senses it has.\n\nFinally, when you cast a spell with a range of touch, your familiar can deliver the touch. Your familiar must be within 100 feet of you, and it must take a Reaction to deliver the touch when you cast the spell.\n\nCombat. The familiar is an ally to you and your allies. It rolls its own Initiative and acts on its own turn. A familiar can’t attack, but it can take other actions as normal.\n\nDisappearance of the Familiar. When the familiar drops to 0 Hit Points, it disappears. It reappears after you cast this spell again. As a Magic action, you can temporarily dismiss the familiar to a pocket dimension. Alternatively, you can dismiss it forever. As a Magic action while it is temporarily dismissed, you can cause it to reappear in an unoccupied space within 30 feet of you. Whenever the familiar drops to 0 Hit Points or disappears into the pocket dimension, it leaves behind in its space anything it was wearing or carrying.\n\nOne Familiar Only. You can’t have more than one familiar at a time. If you cast this spell while you have a familiar, you instead cause it to adopt a new eligible form.",
        "upgrade": "The fog’s radius increases by 20 feet for each spell slot level above 1."
      },
      {
        "name": "fog_cloud",
        "school": "Conjuration",
        "class": ["druid", "ranger", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Concentration, up to 1 hour",
        "effect": "You create a 20-foot-radius Sphere of fog centered on a point within range. The Sphere is Heavily Obscured. It lasts for the duration or until a strong wind (such as one created by Gust of Wind) disperses it.",
        "upgrade": ""
      },
      {
        "name": "goodberry",
        "school": "Conjuration",
        "class": ["druid", "ranger"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S, M (a sprig of mistletoe)",
        "duration": "24 hours",
        "effect": "Ten berries appear in your hand and are infused with magic for the duration. A creature can take a Bonus Action to eat one berry. Eating a berry restores 1 Hit Point, and the berry provides enough nourishment to sustain a creature for one day.\n\nUneaten berries disappear when the spell ends.",
        "upgrade": ""
      },
      {
        "name": "grease",
        "school": "Conjuration",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S, M (a bit of pork rind or butter)",
        "duration": "1 minute",
        "effect": "Nonflammable grease covers the ground in a 10-foot square centered on a point within range and turns it into Difficult Terrain for the duration.\n\nWhen the grease appears, each creature standing in its area must succeed on a Dexterity saving throw or have the Prone condition. A creature that enters the area or ends its turn there must also succeed on that save or fall Prone.",
        "upgrade": ""
      },
      {
        "name": "buiding_bolt",
        "school": "Evocation",
        "class": ["cleric"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "1 round",
        "effect": "You hurl a bolt of light toward a creature within range. Make a ranged spell attack against the target. On a hit, it takes 4d6 Radiant damage, and the next attack roll made against it before the end of your next turn has Advantage.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "hail_of_thorns",
        "school": "Conjuration",
        "class": ["ranger"],
        "casting_time": "Bonus Action, which you take immediately after hitting a creature with a Ranged weapon",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "As you hit the creature, this spell creates a rain of thorns that sprouts from your Ranged weapon or ammunition. The target of the attack and each creature within 5 feet of it make a Dexterity saving throw, taking 1d10 Piercing damage on a failed save or half as much damage on a successful one.",
        "upgrade": "The damage increases by 1d10 for each spell slot level above 1."
      },
      {
        "name": "healing_word",
        "school": "Abjuration",
        "class": ["bard", "cleric", "druid"],
        "casting_time": "Bonus Action",
        "range": "60 feet",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "A creature of your choice that you can see within range regains Hit Points equal to 2d4 plus your spellcasting ability modifier.",
        "upgrade": "The healing increases by 2d4 for each spell slot level above 1."
      },
      {
        "name": "hellish_rebuke",
        "school": "Evocation",
        "class": ["warlock"],
        "casting_time": "Reaction, which you take in response to taking damage from a creature that you can see within 60 feet of yourself",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "The creature that damaged you is momentarily surrounded by green flames. It makes a Dexterity saving throw, taking 2d10 Fire damage on a failed save or half as much damage on a successful one.",
        "upgrade": "The damage increases by 1d10 for each spell slot level above 1."
      },
      {
        "name": "heroism",
        "school": "Enchantment",
        "class": ["bard", "paladin"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "A willing creature you touch is imbued with bravery. Until the spell ends, the creature is immune to the Frightened condition and gains Temporary Hit Points equal to your spellcasting ability modifier at the start of each of its turns.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "hex",
        "school": "Enchantment",
        "class": ["warlock"],
        "casting_time": "Bonus Action",
        "range": "90 feet",
        "components": "V, S, M (the petrified eye of a newt)",
        "duration": "Concentration, up to 1 hour",
        "effect": "You place a curse on a creature that you can see within range. Until the spell ends, you deal an extra 1d6 Necrotic damage to the target whenever you hit it with an attack roll. Also, choose one ability when you cast the spell. The target has Disadvantage on ability checks made with the chosen ability.\n\nIf the target drops to 0 Hit Points before this spell ends, you can take a Bonus Action on a later turn to curse a new creature.",
        "upgrade": "Your Concentration can last longer with a spell slot of level 2 (up to 4 hours), 3–4 (up to 8 hours), or 5+ (24 hours)."
      },
      {
        "name": "hunter's_mark",
        "school": "Divination",
        "class": ["ranger"],
        "casting_time": "Bonus Action",
        "range": "90 feet",
        "components": "V",
        "duration": "Concentration, up to 1 hour",
        "effect": "You magically mark one creature you can see within range as your quarry. Until the spell ends, you deal an extra 1d6 Force damage to the target whenever you hit it with an attack roll. You also have Advantage on any Wisdom (Perception or Survival) check you make to find it.\n\nIf the target drops to 0 Hit Points before this spell ends, you can take a Bonus Action to move the mark to a new creature you can see within range.",
        "upgrade": " Your Concentration can last longer with a spell slot of level 3–4 (up to 8 hours) or 5+ (up to 24 hours)."
      },
      {
        "name": "ice_knife",
        "school": "Conjuration",
        "class": ["druid", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "S, M (a drop of water or a piece of ice)",
        "duration": "Instantaneous",
        "effect": "You create a shard of ice and fling it at one creature within range. Make a ranged spell attack against the target. On a hit, the target takes 1d10 Piercing damage. Hit or miss, the shard then explodes. The target and each creature within 5 feet of it must succeed on a Dexterity saving throw or take 2d6 Cold damage.",
        "upgrade": "The Cold damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "identify",
        "school": "Divination",
        "class": ["bard", "wizard"],
        "casting_time": "1 minute or Ritual",
        "range": "Touch",
        "components": "V, S, M (a pearl worth 100+ GP)",
        "duration": "Instantaneous",
        "effect": "You touch an object throughout the spell’s casting. If the object is a magic item or some other magical object, you learn its properties and how to use them, whether it requires Attunement, and how many charges it has, if any. You learn whether any ongoing spells are affecting the item and what they are. If the item was created by a spell, you learn that spell’s name.\n\nIf you instead touch a creature throughout the casting, you learn which ongoing spells, if any, are currently affecting it.",
        "upgrade": ""
      },
      {
        "name": "Illusory_script",
        "school": "Illusion",
        "class": ["bard", "warlock", "wizard"],
        "casting_time": "1 minute or Ritual",
        "range": "Touch",
        "components": "S, M (ink worth 10+ GP, which the spell consumes)",
        "duration": "10 days",
        "effect": "You write on parchment, paper, or another suitable material and imbue it with an illusion that lasts for the duration. To you and any creatures you designate when you cast the spell, the writing appears normal, seems to be written in your hand, and conveys whatever meaning you intended when you wrote the text. To all others, the writing appears as if it were written in an unknown or magical script that is unintelligible. Alternatively, the illusion can alter the meaning, handwriting, and language of the text, though the language must be one you know.\n\nIf the spell is dispelled, the original script and the illusion both disappear.\n\nA creature that has Truesight can read the hidden message.",
        "upgrade": ""
      },
      {
        "name": "inflict_wounds",
        "school": "Necromancy",
        "class": ["cleric"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "A creature you touch makes a Constitution saving throw, taking 2d10 Necrotic damage on a failed save or half as much damage on a successful one.",
        "upgrade": "The damage increases by 1d10 for each spell slot level above 1."
      },
      {
        "name": "jump",
        "school": "Transmutation",
        "class": ["druid", "ranger", "sorcerer", "wizard"],
        "casting_time": "Bonus Action",
        "range": "Touch",
        "components": "V, S, M (a grasshopper’s hind leg)",
        "duration": "1 minute",
        "effect": "You touch a willing creature. Once on each of its turns until the spell ends, that creature can jump up to 30 feet by spending 10 feet of movement.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "longstrider",
        "school": "Transmutation",
        "class": ["bard", "druid", "ranger", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (a pinch of dirt)",
        "duration": "1 hour",
        "effect": "You touch a creature. The target’s Speed increases by 10 feet until the spell ends.",
        "upgrade": "You can target one additional creature for each spell slot level above 1."
      },
      {
        "name": "mage_armor",
        "school": "Abjuration",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (a piece of cured leather)",
        "duration": "8 hours",
        "effect": "ou touch a willing creature who isn’t wearing armor. Until the spell ends, the target’s base AC becomes 13 plus its Dexterity modifier. The spell ends early if the target dons armor.",
        "upgrade": ""
      },
      {
        "name": "magic_missile",
        "school": "Evocation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You create three glowing darts of magical force. Each dart strikes a creature of your choice that you can see within range. A dart deals 1d4 + 1 Force damage to its target. The darts all strike simultaneously, and you can direct them to hit one creature or several.",
        "upgrade": "The spell creates one more dart for each spell slot level above 1."
      },
      {
        "name": "protection_from_evil_and_good",
        "school": "Abjuration",
        "class": ["cleric", "druid", "paladin", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (a flask of Holy Water worth 25+ GP, which the spell consumes)",
        "duration": "Concentration, up to 10 minute",
        "effect": "Until the spell ends, one willing creature you touch is protected against creatures that are Aberrations, Celestials, Elementals, Fey, Fiends, or Undead. The protection grants several benefits. Creatures of those types have Disadvantage on attack rolls against the target. The target also can’t be possessed by or gain the Charmed or Frightened conditions from them. If the target is already possessed, Charmed, or Frightened by such a creature, the target has Advantage on any new saving throw against the relevant effect.",
        "upgrade": ""
      },
      {
        "name": "purify_food_and_drink",
        "school": "Transmutation",
        "class": ["cleric", "druid", "paladin"],
        "casting_time": "Action or Ritual",
        "range": "10 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You remove poison and rot from nonmagical food and drink in a 5-foot-radius Sphere centered on a point within range.",
        "upgrade": ""
      },
      {
        "name": "ray_of_sickness",
        "school": "Necromancy",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You shoot a greenish ray at a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 2d8 Poison damage and has the Poisoned condition until the end of your next turn.",
        "upgrade": "The damage increases by 1d8 for each spell slot level above 1."
      },
      {
        "name": "sanctuary",
        "school": "Abjuration",
        "class": ["cleric"],
        "casting_time": "Bonus Action",
        "range": "30 feet",
        "components": "V, S, M (a shard of glass from a mirror)",
        "duration": "1 minute",
        "effect": "You ward a creature within range. Until the spell ends, any creature who targets the warded creature with an attack roll or a damaging spell must succeed on a Wisdom saving throw or either choose a new target or lose the attack or spell. This spell doesn’t protect the warded creature from areas of effect.",
        "upgrade": "The spell ends if the warded creature makes an attack roll, casts a spell, or deals damage"
      },
      {
        "name": "searing_smite",
        "school": "Evocation",
        "class": ["paladin"],
        "casting_time": "1 minute",
        "range": "Self",
        "components": "V",
        "duration": "1 minute",
        "effect": "As you hit the target, it takes an extra 1d6 Fire damage from the attack. At the start of each of its turns until the spell ends, the target takes 1d6 Fire damage and then makes a Constitution saving throw. On a failed save, the spell continues. On a successful save, the spell ends.",
        "upgrade": "All the damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "shield",
        "school": "Abjuration",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Reaction, which you take when you are hit by an attack roll or targeted by the Magic Missile spell",
        "range": "Self",
        "components": "V, S",
        "duration": "1 round",
        "effect": "An imperceptible barrier of magical force protects you. Until the start of your next turn, you have a +5 bonus to AC, including against the triggering attack, and you take no damage from Magic Missile.",
        "upgrade": ""
      },
      {
        "name": "shield_of_faith",
        "school": "Abjuration",
        "class": ["cleric", "paladin"],
        "casting_time": "Bonus Action",
        "range": "60 feet",
        "components": "V, S, M (a prayer scroll)",
        "duration": "Concentration, up to 10 minute",
        "effect": "A shimmering field surrounds a creature of your choice within range, granting it a +2 bonus to AC for the duration.",
        "upgrade": ""
      },
      {
        "name": "silent_image",
        "school": "Illusion",
        "class": ["bard", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S, M (a bit of fleece)",
        "duration": "Concentration, up to 10 minute",
        "effect": "You create the image of an object, a creature, or some other visible phenomenon that is no larger than a 15-foot Cube. The image appears at a spot within range and lasts for the duration. The image is purely visual; it isn’t accompanied by sound, smell, or other sensory effects.\n\nAs a Magic action, you can cause the image to move to any spot within range. As the image changes location, you can alter its appearance so that its movements appear natural for the image. For example, if you create an image of a creature and move it, you can alter the image so that it appears to be walking.\n\nPhysical interaction with the image reveals it to be an illusion, since things can pass through it. A creature that takes a Study action to examine the image can determine that it is an illusion with a successful Intelligence (Investigation) check against your spell save DC. If a creature discerns the illusion for what it is, the creature can see through the image.",
        "upgrade": ""
      },
      {
        "name": "speak_with_animals",
        "school": "Divination",
        "class": ["bard", "druid", "ranger", "warlock"],
        "casting_time": "Action or Ritual",
        "range": "Self",
        "components": "V, S",
        "duration": "10 minutes",
        "effect": "For the duration, you can comprehend and verbally communicate with Beasts, and you can use any of the Influence action’s skill options with them.\n\nMost Beasts have little to say about topics that don’t pertain to survival or companionship, but at minimum, a Beast can give you information about nearby locations and monsters, including whatever it has perceived within the past day.",
        "upgrade": ""
      },
      {
        "name": "tasha's_hideous_laughter",
        "school": "Enchantment",
        "class": ["bard", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (a tart and a feather)",
        "duration": "Concentration, up to 1 minute",
        "effect": "One creature of your choice that you can see within range makes a Wisdom saving throw. On a failed save, it has the Prone and Incapacitated conditions for the duration. During that time, it laughs uncontrollably if it’s capable of laughter, and it can’t end the Prone condition on itself.\n\nAt the end of each of its turns and each time it takes damage, it makes another Wisdom saving throw. The target has Advantage on the save if the save is triggered by damage. On a successful save, the spell ends",
        "upgrade": "You can target one additional creature for each spell slot level about 1."
      },
      {
        "name": "tenser's_floating_disk",
        "school": "Conjuration",
        "class": ["wizard"],
        "casting_time": "Action or Ritual",
        "range": "30 feet",
        "components": "V, S, M (a drop of mercury)",
        "duration": "1 hour",
        "effect": "This spell creates a circular, horizontal plane of force, 3 feet in diameter and 1 inch thick, that floats 3 feet above the ground in an unoccupied space of your choice that you can see within range. The disk remains for the duration and can hold up to 500 pounds. If more weight is placed on it, the spell ends, and everything on the disk falls to the ground.\n\nThe disk is immobile while you are within 20 feet of it. If you move more than 20 feet away from it, the disk follows you so that it remains within 20 feet of you. It can move across uneven terrain, up or down stairs, slopes and the like, but it can’t cross an elevation change of 10 feet or more. For example, the disk can’t move across a 10-foot-deep pit, nor could it leave such a pit if it was created at the bottom.\n\nIf you move more than 100 feet from the disk (typically because it can’t move around an obstacle to follow you), the spell ends.",
        "upgrade": ""
      },
      {
        "name": "thunderous_smite",
        "school": "Evocation",
        "class": ["paladin"],
        "casting_time": "Bonus Action, which you take immediately after hitting a target with a Melee weapon or an Unarmed Strike",
        "range": "Self",
        "components": "V",
        "duration": "Instantaneous",
        "effect": "Your strike rings with thunder that is audible within 300 feet of you, and the target takes an extra 2d6 Thunder damage from the attack. Additionally, if the target is a creature, it must succeed on a Strength saving throw or be pushed 10 feet away from you and have the Prone condition.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      },
      {
        "name": "thunderwave",
        "school": "Evocation",
        "class": ["bard", "druid", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You unleash a wave of thunderous energy. Each creature in a 15-foot Cube originating from you makes a Constitution saving throw. On a failed save, a creature takes 2d8 Thunder damage and is pushed 10 feet away from you. On a successful save, a creature takes half as much damage only.\n\nIn addition, unsecured objects that are entirely within the Cube are pushed 10 feet away from you, and a thunderous boom is audible within 300 feet.",
        "upgrade": "The damage increases by 1d8 for each spell slot level above 1."
      },
      {
        "name": "unseen_servant",
        "school": "Conjuration",
        "class": ["bard", "warlock", "wizard"],
        "casting_time": "Action or Ritual",
        "range": "60 feet",
        "components": "V, S, M (a bit of string and of wood)",
        "duration": "1 hour",
        "effect": "This spell creates an Invisible, mindless, shapeless, Medium force that performs simple tasks at your command until the spell ends. The servant springs into existence in an unoccupied space on the ground within range. It has AC 10, 1 Hit Point, and a Strength of 2, and it can’t attack. If it drops to 0 Hit Points, the spell ends.\n\nOnce on each of your turns as a Bonus Action, you can mentally command the servant to move up to 15 feet and interact with an object. The servant can perform simple tasks that a human could do, such as fetching things, cleaning, mending, folding clothes, lighting fires, serving food, and pouring drinks. Once you give the command, the servant performs the task to the best of its ability until it completes the task, then waits for your next command.\n\nIf you command the servant to perform a task that would move it more than 60 feet away from you, the spell ends.",
        "upgrade": ""
      },
      {
        "name": "witch_bolt",
        "school": "Evocation",
        "class": ["sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S, M (a twig struck by lightning)",
        "duration": "Concentration, up to 1 minute",
        "effect": "A beam of crackling energy lances toward a creature within range, forming a sustained arc of lightning between you and the target. Make a ranged spell attack against it. On a hit, the target takes 2d12 Lightning damage.\n\nOn each of your subsequent turns, you can take a Bonus Action to deal 1d12 Lightning damage to the target automatically, even if the first attack missed.\n\nThe spell ends if the target is ever outside the spell’s range or if it has Total Cover from you.",
        "upgrade": "The initial damage increases by 1d12 for each spell slot level above 1."
      },
      {
        "name": "wrathful_smite",
        "school": "Necromancy",
        "class": ["paladin"],
        "casting_time": "Bonus Action, which you take immediately after hitting a creature with a Melee weapon or an Unarmed Strike",
        "range": "Self",
        "components": "V",
        "duration": "1 minute",
        "effect": "The target takes an extra 1d6 Necrotic damage from the attack, and it must succeed on a Wisdom saving throw or have the Frightened condition until the spell ends. At the end of each of its turns, the Frightened target repeats the save, ending the spell on itself on a success.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 1."
      }
    ]
  },
  {
    "level": "2",
    "spell": [
      {
        "name": "aid",
        "school": "Abjuration",
        "class": ["Bard", "Cleric", "Druid", "Paladin", "Ranger"],
        "casting_time": "Action",
        "range": "30ft",
        "components": "V, S, M (a strip of white cloth)",
        "duration": "8 hours",
        "effect": "Choose up to three creatures within range. Each target’s Hit Point maximum and current Hit Points increase by 5 for the duration.",
        "upgrade": "Each target’s Hit Points increase by 5 for each spell slot level above 2."
      },
      {
        "name": "Alter Self",
        "school": "Transmutation",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Concentration, up to 1 hour",
        "effect": "You alter your physical form. Choose one of the following options. Its effects last for the duration, during which you can take a Magic action to replace the option you chose with a different one.\n\nAquatic Adaptation. You sprout gills and grow webs between your fingers. You can breathe underwater and gain a Swim Speed equal to your Speed.\n\nChange Appearance. You alter your appearance. You decide what you look like, including your height, weight, facial features, sound of your voice, hair length, coloration, and other distinguishing characteristics. You can make yourself appear as a member of another species, though none of your statistics change. You can’t appear as a creature of a different size, and your basic shape stays the same; if you’re bipedal, you can’t use this spell to become quadrupedal, for instance. For the duration, you can take a Magic action to change your appearance in this way again.\n\nNatural Weapons. You grow claws (Slashing), fangs (Piercing), horns (Piercing), or hooves (Bludgeoning). When you use your Unarmed Strike to deal damage with that new growth, it deals 1d6 damage of the type in parentheses instead of dealing the normal damage for your Unarmed Strike, and you use your spellcasting ability modifier for the attack and damage rolls rather than using Strength.",
        "upgrade": ""
      },
      {
        "name": "Animal Messenger",
        "school": "Enchantment",
        "class": ["bard", "Druid", "Ranger"],
        "casting_time": "Action or Ritual",
        "range": "30ft",
        "components": "V, S, M (a morsel of food)",
        "duration": "24 Hours",
        "effect": "A Tiny Beast of your choice that you can see within range must succeed on a Charisma saving throw, or it attempts to deliver a message for you (if the target’s Challenge Rating isn’t 0, it automatically succeeds). You specify a location you have visited and a recipient who matches a general description, such as “a person dressed in the uniform of the town guard” or “a red-haired dwarf wearing a pointed hat.” You also communicate a message of up to twenty-five words. The Beast travels for the duration toward the specified location, covering about 25 miles per 24 hours or 50 miles if the Beast can fly.\n\nWhen the Beast arrives, it delivers your message to the creature that you described, mimicking your communication. If the Beast doesn’t reach its destination before the spell ends, the message is lost, and the Beast returns to where you cast the spell.",
        "upgrade": "The spell’s duration increases by 48 hours for each spell slot level above 2."
      },
      {
        "name": "Arcane Lock",
        "school": "Abjuration",
        "class": ["wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (gold dust worth 25+ GP, which the spell consumes)",
        "duration": "Until dispelled",
        "effect": "You touch a closed door, window, gate, container, or hatch and magically lock it for the duration. This lock can’t be unlocked by any nonmagical means. You and any creatures you designate when you cast the spell can open and close the object despite the lock. You can also set a password that, when spoken within 5 feet of the object, unlocks it for 1 minute.",
        "upgrade": ""
      },
      {
        "name": "Arcane Vigor",
        "school": "Abjuration",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Bonus Action",
        "range": "Self",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You tap into your life force to heal yourself. Roll one or two of your unexpended Hit Point Dice, and regain a number of Hit Points equal to the roll’s total plus your spellcasting ability modifier. Those dice are then expended.",
        "upgrade": "The number of unexpended Hit Dice you can roll increases by one for each spell slot level above 2."
      },
      {
        "name": "Augury",
        "school": "Divination",
        "class": ["cleric", "Druid", "wizard"],
        "casting_time": "1 minute or Ritual",
        "range": "Self",
        "components": "V, S, M (specially marked sticks, bones, cards, or other divinatory tokens worth 25+ GP)",
        "duration": "Instantaneous",
        "effect": "You receive an omen from an otherworldly entity about the results of a course of action that you plan to take within the next 30 minutes. The DM chooses the omen from the Omens table.\n\n Weal -- Good\nWoe -- Bad\nWeal and woe -- Good and bad\nIndifference -- Neither good nor bad\n\nThe spell doesn’t account for circumstances, such as other spells, that might change the results.\n\nIf you cast the spell more than once before finishing a Long Rest, there is a cumulative 25 percent chance for each casting after the first that you get no answer.",
        "upgrade": ""
      },
      {
        "name": "Barkskin",
        "school": "Transmutation",
        "class": ["druid", "ranger"],
        "casting_time": "Bonus Action",
        "range": "Touch",
        "components": "V, S, M (a handful of bark)",
        "duration": "1 hour",
        "effect": "You touch a willing creature. Until the spell ends, the target’s skin assumes a bark-like appearance, and the target has an Armor Class of 17 if its AC is lower than that.",
        "upgrade": ""
      },
      {
        "name": "Beast Sense",
        "school": "Divination",
        "class": ["druid", "ranger"],
        "casting_time": "Action or Ritual",
        "range": "Touch",
        "components": "S",
        "duration": "Concentration, up to 1 hour",
        "effect": "You touch a willing Beast. For the duration, you can perceive through the Beast’s senses as well as your own. When perceiving through the Beast’s senses, you benefit from any special senses it has.",
        "upgrade": ""
      },
      {
        "name": "Blindness/Deafness",
        "school": "Transmutation",
        "class": ["bard", "cleric", "sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V",
        "duration": "1 minute",
        "effect": "One creature that you can see within range must succeed on a Constitution saving throw, or it has the Blinded or Deafened condition (your choice) for the duration. At the end of each of its turns, the target repeats the save, ending the spell on itself on a success.",
        "upgrade": "You can target one additional creature for each spell slot level above 2."
      },
      {
        "name": "Blur",
        "school": "Illusion",
        "class": ["sorcerer", "wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V",
        "duration": "Concentration, up to 1 minute",
        "effect": "Your body becomes blurred. For the duration, any creature has Disadvantage on attack rolls against you. An attacker is immune to this effect if it perceives you with Blindsight or Truesight.",
        "upgrade": ""
      },
      {
        "name": "Calm Emotions",
        "school": "Enchantment",
        "class": ["bard", "cleric"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "Each Humanoid in a 20-foot-radius Sphere centered on a point you choose within range must succeed on a Charisma saving throw or be affected by one of the following effects (choose for each creature):\n\nThe creature has Immunity to the Charmed and Frightened conditions until the spell ends. If the creature was already Charmed or Frightened, those conditions are suppressed for the duration.\n\nThe creature becomes Indifferent about creatures of your choice that it’s Hostile toward. This indifference ends if the target takes damage or witnesses its allies taking damage. When the spell ends, the creature’s attitude returns to normal.",
        "upgrade": ""
      },
      {
        "name": "Cloud Of Daggers",
        "school": "Conjuration",
        "class": ["bard", "sorcerer", "warlock", "wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S, M (a sliver of glass)",
        "duration": "Concentration, up to 1 minute",
        "effect": "You conjure spinning daggers in a 5-foot Cube centered on a point within range. Each creature in that area takes 4d4 Slashing damage. A creature also takes this damage if it enters the Cube or ends its turn there or if the Cube moves into its space. A creature takes this damage only once per turn.\n\nOn your later turns, you can take a Magic action to teleport the Cube up to 30 feet.",
        "upgrade": "The damage increases by 2d4 for each spell slot level above 2."
      },
      {
        "name": "Continual Flame",
        "school": "Evocation",
        "class": ["cleric", "druid", "wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (ruby dust worth 50+ GP, which the spell consumes)",
        "duration": "Until dispelled",
        "effect": "A flame springs from an object that you touch. The effect casts Bright Light in a 20-foot radius and Dim Light for an additional 20 feet. It looks like a regular flame, but it creates no heat and consumes no fuel. The flame can be covered or hidden but not smothered or quenched.",
        "upgrade": ""
      },
      {
        "name": "Cordon Of Arrows",
        "school": "Transmutation",
        "class": ["Ranger"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (an ornamental braid)",
        "duration": "8 hours",
        "effect": "You touch up to four nonmagical Arrows or Bolts and plant them in the ground in your space. Until the spell ends, the ammunition can’t be physically uprooted, and whenever a creature other than you enters a space within 30 feet of the ammunition for the first time on a turn or ends its turn there, one piece of ammunition flies up to strike it. The creature must succeed on a Dexterity saving throw or take 2d4 Piercing damage. The piece of ammunition is then destroyed. The spell ends when none of the ammunition remains planted in the ground.\n\nWhen you cast this spell, you can designate any creatures you choose, and the spell ignores them.",
        "upgrade": "The amount of ammunition that can be affected increases by two for each spell slot level above 2."
      },
      {
        "name": "Crown Of Madness",
        "school": "Enchantment ",
        "class": ["Bard", "Sorcerer", "Warlock", "Wizard"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "One creature that you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The creature succeeds automatically if it isn’t Humanoid.\n\nOne creature that you can see within range must succeed on a Wisdom saving throw or have the Charmed condition for the duration. The creature succeeds automatically if it isn’t Humanoid.\n\nA spectral crown appears on the Charmed target's head, and it must use its action before moving on each of its turns to make a melee attack against a creature other than itself that you mentally choose. The target can act normally on its turn if you choose no creature or if no creature is within its reach. The target repeats the save at the end of each of its turns, ending the spell on itself on a success.\n\nOn your later turns, you must take the Magic action to maintain control of the target, or the spell ends.",
        "upgrade": ""
      },
      {
        "name": "Darkness",
        "school": "Evocation",
        "class": ["Sorcerer", "Warlock", "Wizard"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, M (bat fur and a piece of coal)",
        "duration": "Concentration, up to 10 minute",
        "effect": "For the duration, magical Darkness spreads from a point within range and fills a 15-foot-radius Sphere. Darkvision can’t see through it, and nonmagical light can’t illuminate it.\n\nAlternatively, you cast the spell on an object that isn’t being worn or carried, causing the Darkness to fill a 15-foot Emanation originating from that object. Covering that object with something opaque, such as a bowl or helm, blocks the Darkness.\n\nIf any of this spell’s area overlaps with an area of Bright Light or Dim Light created by a spell of level 2 or lower, that other spell is dispelled.",
        "upgrade": ""
      },
      {
        "name": "Darkvision",
        "school": "Transmutation",
        "class": ["Druid", "Ranger", "Sorcerer", "Wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (a dried carrot)",
        "duration": "8 hours",
        "effect": "For the duration, a willing creature you touch has Darkvision with a range of 150 feet.",
        "upgrade": ""
      },
      {
        "name": "Detect Thoughts",
        "school": "Divination",
        "class": ["Bard", "Sorcerer", "Wizard"],
        "casting_time": "Action",
        "range": "Self",
        "components": "V, S, M (1 Copper Piece)",
        "duration": "Concentration, up to 1 minute",
        "effect": "You activate one of the effects below. Until the spell ends, you can activate either effect as a Magic action on your later turns.\n\nSense Thoughts. You sense the presence of thoughts within 30 feet of yourself that belong to creatures that know languages or are telepathic. You don’t read the thoughts, but you know that a thinking creature is present.\n\nThe spell is blocked by 1 foot of stone, dirt, or wood; 1 inch of metal; or a thin sheet of lead.\n\nRead Thoughts. Target one creature you can see within 30 feet of yourself or one creature within 30 feet of yourself that you detected with the Sense Thoughts option. You learn what is most on the target’s mind right now. If the target doesn’t know any languages and isn’t telepathic, you learn nothing.\n\nAs a Magic action on your next turn, you can try to probe deeper into the target’s mind. If you probe deeper, the target makes a Wisdom saving throw. On a failed save, you discern the target’s reasoning, emotions, and something that looms large in its mind (such as a worry, love, or hate). On a successful save, the spell ends. Either way, the target knows that you are probing into its mind, and until you shift your attention away from the target’s mind, the target can take an action on its turn to make an Intelligence (Arcana) check against your spell save DC, ending the spell on a success.\n\n",
        "upgrade": ""
      },
      {
        "name": "Dragon's Breath",
        "school": "Transmutation",
        "class": ["Sorcerer", "Wizard"],
        "casting_time": "Bonus Action",
        "range": "Touch",
        "components": "V, S, M (a hot pepper)",
        "duration": "Concentration, up to 1 minute",
        "effect": "You touch one willing creature, and choose Acid, Cold, Fire, Lightning, or Poison. Until the spell ends, the target can take a Magic action to exhale a 15-foot Cone. Each creature in that area makes a Dexterity saving throw, taking 3d6 damage of the chosen type on a failed save or half as much damage on a successful one.",
        "upgrade": "The damage increases by 1d6 for each spell slot level above 2."
      },
      {
        "name": "Enhance Ability",
        "school": "Transmutation",
        "class": ["Bard", "Cleric", "Druid", "Ranger", "Sorcerer", "Wizard"],
        "casting_time": "Action",
        "range": "Touch",
        "components": "V, S, M (fur or a feather)",
        "duration": "Concentration, up to 1 hour",
        "effect": "You touch a creature and choose Strength, Dexterity, Intelligence, Wisdom, or Charisma. For the duration, the target has Advantage on ability checks using the chosen ability.",
        "upgrade": "You can target one additional creature for each spell slot level above 2. You can choose a different ability for each target."
      },
      {
        "name": "Enlarge/Reduce",
        "school": "Transmutation",
        "class": ["Bard", "Druid", "Sorcerer", "Wizard"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S, M (a pinch of powdered iron)",
        "duration": "Concentration, up to 1 minute",
        "effect": "For the duration, the spell enlarges or reduces a creature or an object you can see within range (see the chosen effect below). A targeted object must be neither worn nor carried. If the target is an unwilling creature, it can make a Constitution saving throw. On a successful save, the spell has no effect.\n\nFor the duration, the spell enlarges or reduces a creature or an object you can see within range (see the chosen effect below). A targeted object must be neither worn nor carried. If the target is an unwilling creature, it can make a Constitution saving throw. On a successful save, the spell has no effect.Everything that a targeted creature is wearing and carrying changes size with it. Any item it drops returns to normal size at once. A thrown weapon or piece of ammunition returns to normal size immediately after it hits or misses a target.\n\nEnlarge. The target’s size increases by one category—from Medium to Large, for example. The target also has Advantage on Strength checks and Strength saving throws. The target’s attacks with its enlarged weapons or Unarmed Strikes deal an extra 1d4 damage on a hit.\n\nReduce. The target’s size decreases by one category—from Medium to Small, for example. The target also has Disadvantage on Strength checks and Strength saving throws. The target’s attacks with its reduced weapons or Unarmed Strikes deal 1d4 less damage on a hit (this can’t reduce the damage below 1).",
        "upgrade": ""
      },
      {
        "name": "Enthrall",
        "school": "Enchantment ",
        "class": ["Bard", "Warlock"],
        "casting_time": "Action",
        "range": "60 feet",
        "components": "V, S",
        "duration": "Concentration, up to 1 minute",
        "effect": "You weave a distracting string of words, causing creatures of your choice that you can see within range to make a Wisdom saving throw. Any creature you or your companions are fighting automatically succeeds on this save. On a failed save, a target has a −10 penalty to Wisdom (Perception) checks and Passive Perception until the spell ends.",
        "upgrade": ""
      },
      {
        "name": "Find Steed",
        "school": "Conjuration",
        "class": ["Paladin"],
        "casting_time": "Action",
        "range": "30 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You summon an otherworldly being that appears as a loyal steed in an unoccupied space of your choice within range. This creature uses the Otherworldly Steed stat block. If you already have a steed from this spell, the steed is replaced by the new one.\n\nThe steed resembles a Large, rideable animal of your choice, such as a horse, a camel, a dire wolf, or an elk. Whenever you cast the spell, choose the steed’s creature type—Celestial, Fey, or Fiend—which determines certain traits in the stat block.\n\nCombat. The steed is an ally to you and your allies. In combat, it shares your Initiative count, and it functions as a controlled mount while you ride it (as defined in the rules on mounted combat). If you have the Incapacitated condition, the steed takes its turn immediately after yours and acts independently, focusing on protecting you.\n\nDisappearance of the Steed. The steed disappears if it drops to 0 Hit Points or if you die. When it disappears, it leaves behind anything it was wearing or carrying. If you cast this spell again, you decide whether you summon the steed that disappeared or a different one.\n\n",
        "upgrade": "Use the spell slot’s level for the spell’s level in the stat block.",
        "creature": [
          "Large Celestial, Fey, or Fiend (Your Choice), Neutral",
          "10 + 1 per spell level",
          "5 + 10 per spell level (the steed has a number of Hit Dice [d10s] equal to the spell’s level)",
          " 60 ft., Fly 60 ft. (requires level 4+ spell)",
          "18 (+4/+4)",
          "12 (+1/+1)",
          "14 (+2/+2)",
          "6 (-2/-2)",
          "12 (+1/+1)",
          "8 (-1/-1)",
          "Passive Perception 11",
          "Telepathy 1 mile (works only with you)",
          "None (XP 0; PB equals your Proficiency Bonus)",
          "Life Bond. When you regain Hit Points from a level 1+ spell, the steed regains the same number of Hit Points if you’re within 5 feet of it.",
          "Otherworldly Slam. Melee Attack Roll: Bonus equals your spell attack modifier, reach 5 ft. Hit: 1d8 plus the spell’s level of Radiant (Celestial), Psychic (Fey), or Necrotic (Fiend) damage.",
          "Fell Glare (Fiend Only; Recharges after a Long Rest). Wisdom Saving Throw: DC equals your spell save DC, one creature within 60 feet the steed can see. Failure: The target has the Frightened condition until the end of your next turn.\n\nFey Step (Fey Only; Recharges after a Long Rest). The steed teleports, along with its rider, to an unoccupied space of your choice up to 60 feet away from itself.\n\nHealing Touch (Celestial Only; Recharges after a Long Rest). One creature within 5 feet of the steed regains a number of Hit Points equal to 2d8 plus the spell’s level."
        ]
      },
      {
        "name": "Find Traps",
        "school": "Divination",
        "class": ["Cleric", "Druid", "Ranger"],
        "casting_time": "Action",
        "range": "120 feet",
        "components": "V, S",
        "duration": "Instantaneous",
        "effect": "You sense any trap within range that is within line of sight. A trap, for the purpose of this spell, includes any object or mechanism that was created to cause damage or other danger. Thus, the spell would sense the Alarm or Glyph of Warding spell or a mechanical pit trap, but it wouldn’t reveal a natural weakness in the floor, an unstable ceiling, or a hidden sinkhole.\n\n",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      },
      {
        "name": "",
        "school": "",
        "class": [""],
        "casting_time": "",
        "range": "",
        "components": "",
        "duration": "",
        "effect": "",
        "upgrade": ""
      }
    ]
  }
]
